# MepPreheatHotwaterLoop Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepPreheatHotwaterLoop Property
ParameterTypeId Class See Also
---
"Preheat Hot Water Loop"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepPreheatHotwaterLoop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepPreheatHotwaterLoop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepPreheatHotwaterLoop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace